# HiveQL

If you are familiar with `SQL` you should feel very comfortable with `HiveQL` as they are almost similar.
Check out:

- [Hive Language Manual](https://cwiki.apache.org/confluence/display/hive/languagemanual)
- [CheatSheet](http://hortonworks.com/wp-content/uploads/2016/05/Hortonworks.CheatSheet.SQLtoHive.pdf)

In [ ]:
%load_ext sql
%sql hive://hadoop@localhost:10000/text

## Can you guess what the outputs of the commands will be?

In [ ]:
%sql select * from raw_holmes limit 5

In [ ]:
%%sql
-- triggers a map reduce job!
SELECT
    count(line) AS count
FROM
    raw_holmes

In [ ]:
%sql select array('A','B','C') as my_array

In [ ]:
%sql select explode(array('A','B','C'))

In [ ]:
%sql select map('A',10,'B',20,'C',30) as my_map

In [ ]:
%sql select explode(map('A',10,'B',20,'C',30)) as (key,value)

In [ ]:
%%sql

SELECT * FROM(
    SELECT explode(map('A',10,'B',20,'C',30)) as (a,b)
) my_table

In [ ]:
%%sql

SELECT * FROM (
    SELECT explode(array(0,1)) as first
) test
LATERAL VIEW EXPLODE(ARRAY(0, 1)) lateral_view as second
LATERAL VIEW EXPLODE(ARRAY(0, 1)) lateral_view as third

In [ ]:
%sql select inline(array(struct('A', 10, '2015-01-01'),struct('B', 20, '2016-02-02'))) as (col1, col2, col3)